package test2;

/*
 * 날짜 : 2025/01/10
 * 이름 : 최명기
 * 내용 : 자바 배열 문자 출력 연습문제
 * 
 * 
 * 선택정렬
 * - 알고리즘에서 배열의 원소를 정렬하는 가장 기본적인 방법
 * - 정렬 알고리즘에는 선택정렬, 삽입정렬, 퀵정렬, 버블정렬 등이 있다
 * 
 * 정렬단계
 * 1단계 : 배열의 1번째 원소를 2,3,4,5 번째 원소와 차례로 비교
 * 2단계 : 1번째 원소보다 작은 원소를 찾으면 서로 자리 교환
 * 3단계 : 배열의 두번쨰 원소보다 작은 원소를 찾으면 서로 자리 교환
 * 4단계 : 두번째 원소보다 작은 원소를 찾으면 서로 자리 교환
 * 5단계 : 위와 같이 최종 숫자가 하나 남을 때까지 반복 수행
 * 
 */
public class Test04 {
	public static void main(String[] args) {
		int arr[] = {4,2,1,5,3};
		
		
			for (int i =0; i<4; i++) {
				for(int k = i+1; k<5; k++) {
					if (arr[i] > arr[k] ) {
						int temp = arr[k];
						arr[k] = arr[i];
						arr[i] = temp;
					}
				}
			}
			
			// 정렬된 배열 출력하기
			for (int n :arr ) {
					System.out.println(n+" ");
		
	}
}
}